artillery/test.yaml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 20
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 60
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "ids.csv"
    fields:
      - "id"

scenarios:
  - name: "Post & Get ID"
    flow:
    - post:
        url: "/api/v1/post"
        json:
          id: "{{ id }}"
        capture:
          - json: "$.response.id"
            as: "userid"
    - think: 2
    - get:
        url: "/api/v1/get?id={{ userid }}"
        capture:
          - json: "$.response.id"
            as: "userid2"